package day01;

public class 단축키 {
// 주석		: 컨트롤 + 쉬프트 + c
// 한줄 복사 	: 컨트롤 + 알트 + ↑/↓
// 한줄 삭제 	: 컨트롤 + D
// 코드 이동 	: 알트 + ↑/↓
// 스크롤 이동 : 컨트롤 + ↑/↓
// 새 파일 생성: 컨트롤 + N
// 탭 종료 	: 컨트롤 + W
// 전체 탭 종료: 컨트롤 + 쉬프트 + W
// 컴파일 	: 컨트롤 + F11
// 찾기 바꾸기 : 컨트롤 + F
// 단어 서치 	: 컨트롤 + K
// -> 키워드 드래그 하고 이거 키워드 키워드 키워드
// 파일 찾기 	: 컨트롤 + 쉬프트 + R
// 코드 찾기 	: 컨트롤 + H
// 퀵 서치 	: 컨트롤 + 알트 + 쉬프트 + L
// 앞으로 가기 : 컨트로 + Y
	public static void main(String[] args) {
		
	}
}
//자동완성
//1. [window]
//2. [preferences] (설정)
//3. [java] > [Editor] > [Template]
//4. 자동완성 키워드 작성
